Repository: zte8131/woo-shipping-dpd-baltic
Catalog: woo-shipping-dpd-baltic/languages/woo-shipping-dpd-baltic-*.po
Languages: et, lt_lt, lv

source: DPD home delivery
et: DPD kullerteenus
lt_lt: DPD pristatymas į namus
lv: DPD piegāde ar kurjeru

source: DPD home delivery shipping method
et: DPD kullerteenus tarnemeetod
lt_lt: DPD pristatymas į namus
lv: DPD piegāde ar kurjeru (DPD B2C)

source: Minimum order amount for free shipping
et: Miinimum tellimuse summa tasuta tarneks
lt_lt: Minimalus užsakymo suma nemokamam pristatymui
lv: Bezmaksas piegāde sākas no

source: Users have to spend this amount to get free shipping.
et: Kasutajad peavad tasuta tarne jaoks vähemalt selle summa kulutama
lt_lt: Pirkėjas turi išleisti šitą sumą, kad gautų nemokamą pristatymą.
lv: Lietotājam būs jāiztērē šāda summa, lai saņemtu bezmaksas piegādi.

source: Per order
et: Tellimuse kaupa
lt_lt: Nuo užsakymo
lv: Par kopējo pasūtījumu

source: Weight based
et: Kaalu järgi
lt_lt: Pagal svorį
lv: Pēc svara

source: Rates
et: Hinnad
lt_lt: Kainos
lv: Cenas

source: Example: 5:10.00,7:12.00 Weight:Price,Weight:Price, etc...
et: Näide: 5:10.00,7:12.00 Kaal:Hind,Kaal:Hind jne...
lt_lt: Pavyzdžiui: 5:10.00,7:12.00 Svors:Kaina,Svoris:Kaina, ir t.t....
lv: Piemērs: 5:10.00,7:12.00 Svars:Cena,Svars:Cena,utt.

source: Deliver between:
et: Toimetada ajavahemikus:
lt_lt: Pristatymas tarp
lv: Piegādes laika intervāls:

source: DPD home delivery on Saturday
et: DPD kullerteenus laupäeval
lt_lt: DPD pristatymas į namus šeštadienį
lv: DPD piegāde ar kurjeru sestdienā

source: DPD home delivery on Saturday shipping method
et: DPD kullerteenus laupäeval tarnemeetod
lt_lt: DPD pristatymas į namus šeštadienį
lv: DPD piegāde ar kurjeru sestdienā (DPD B2C pakalpojums un DPD Plus pakalpojums Sestdiena)

source: DPD home delivery on Saturdays
et: DPD kullerteenus laupäeval
lt_lt: DPD pristatymas į namus šeštadienį
lv: DPD piegāde ar kurjeru Sestdienā

source: Enabled
et: Lubatud
lt_lt: Įgalinta
lv: Aktivizēts

source: Yes
et: Jah
lt_lt: Taip
lv: Jā

source: Morning from
et: Hommikul alates
lt_lt: Ryte nuo
lv: Rīts no

source: Morning to
et: Hommikul kuni
lt_lt: Ryte iki
lv: Rīts līdz

source: Noon from
et: Lõunal alates
lt_lt: Popiet nuo
lv: Vakars no

source: Noon to
et: Lõunal kuni
lt_lt: Popiet iki
lv: Vakars līdz

source: DPD Pickup points (parcel lockers and -shops)
et: DPD pakiautomaadid
lt_lt: DPD Pickup paštomatai

source: DPD Pickup points shipping method
et: DPD pakiautomaadid tarnemeetod
lt_lt: Pristatymas į DPD Pickup paštomatą
lv: Piegāde uz DPD Pickup punktiem (Pickup pakalpojums)

source: Selected Pickup Point:
et: Valitud pakiautomaat
lt_lt: Pasirinktas DPD Pickup paštomatas:
lv: Izvēlētais Pickup punkts:

source: DPD Pickup points
et: DPD pakiautomaadid
lt_lt: DPD Pickup paštomatai
lv: Piegāde uz DPD Pickup punktiem

source: Please select a Pickup Point
et: Palun vali pakiautomaat
lt_lt: Pasirinkite DPD Pickup paštomatą
lv: Lūdzu izvēlaties Pickup punktu

source: DPD home delivery on same day
et: DPD kuller (sama päeva teenus)
lt_lt: DPD pristatymas į namus tą pačią dieną
lv: DPD Same Day piegāde ar kurjeru

source: DPD home delivery on same day shipping method
et: DPD kuller (sama päeva teenus) tarnemeetod
lt_lt: DPD pristatymas į namus tą pačią dieną
lv: DPD Same Day piegāde ar kurjeru (DPD SAME DAY pakalpojums)

source: Same day text
et: Sama päeva tekst
lv: Tās pašas dienas piegādes nosaukums

source: Today
et: Täna
lt_lt: Šiandien
lv: Šodien

source: Next day text
et: Järgmise päeva tekst
lv: Nākošās dienas piegādes nosaukums

source: Tomorrow
et: Homme
lt_lt: Rytoj
lv: Rītdien

source: DPD same day to Pickup points (parcel lockers and -shops)
et: DPD pakiautomaadid (sama päeva teenus)
lt_lt: Pristatymas į DPD Pickup paštomatą tą pačią dieną

source: DPD same day to Pickup points shipping method (Available only in Riga)
et: DPD pakiautomaadid sama päeva tarnemeetod (ainult Riias)
lt_lt: Pristatymas į DPD Pickup paštomatą tą pačią dieną (tik Rygoje)
lv: Same Day piegāde uz DPD Pickup punktiem (Pieejams tikai Rīgā)

source: DPD same day to Pickup points
et: DPD pakiautomaadid (sama päeva teenus)
lt_lt: Pristatymas į DPD Pickup paštomatą tą pačią dieną
lv: Same Day piegāde uz DPD Pickup punktiem

source: Request DPD courier
et: Telli DPD kuller
lt_lt: Iškviesti DPD kurjerį
lv: Pieteikt DPD kurjeru

source: Close DPD manifest
et: Sulge DPD manifest
lt_lt: Uždaryti DPD siuntų manifestą
lv: Aizvērt DPD manifestu

source: Activate document return service?
et: Aktiveeri dokumenditagastuse teenus?
lt_lt: Aktyvuoti Dokumentų grąžinimo paslaugą?
lv: Aktivizēt ROD/Dokumentu atgriešanas pakalpojumu?

source: Document reference number
et: Dokumendinumber
lt_lt: Dokumento nuorodos numeris
lv: Dokumenta references numurs

source: Select warehouse:
et: Vali ladu:
lt_lt: Pasirinkti sandėlį:
lv: Izvēlēties noliktavu:

source: Print DPD label
et: Trüki DPD silt
lt_lt: Spausdinti DPD etiketę
lv: Drukāt DPD pavadlapu

source: Cancel DPD shipment
et: Tühista DPD saadetis
lt_lt: Atšaukti DPD siuntą
lv: Atcelt DPD sūtījumu

source: Get last parcel status
et: Vaata paki viimast staatust
lt_lt: Gauti siuntos statusą
lv: Saņemt pēdējo pakas statusu

source: Collection request to return from customer
et: Korje kliendi juurest tagastuseks
lt_lt: Siuntos paėmimas iš kliento
lv: Paņemšanas pieprasījums, lai atgrieztu paku no saņēmēja

source: Cancel DPD shipments
et: Tühista DPD saadetised
lt_lt: Atšaukti DPD siuntas
lv: Atcelt DPD sūtījumus

source: Cannot print DPD labels for these orders, because some of orders parcel is not found.
et: Valitud tellimuste pakisilte ei saa printida, sest ühel või mitmel tellimusel ei ole vedajaks DPD.
lt_lt: Nėra galimybės atspausdinti siuntos lipdukų pasirinktiems užsakymams.
lv: Nav iespējams izdrukāt DPD pavadlapas šiem pasūtījumiem, tāpēc, ka viena vai vairākas pakas netika atrastas.

source: DPD label printed for %d order.
et: DPD silt on trükitud %d tellimuse jaoks.
lt_lt: DPD etiketės atspausdintos %d užsakymui.

source: DPD shipment cancelled for %d order.
et: DPD saadetis on %d tellimuse jaoks tühistatud.
lt_lt: DPD siuntos atšauktos %d užsakymui.

source: Cannot print DPD label: Parcel not found
et: Pakisilti ei saa printida: DPD tellimust ei leitud
lt_lt: Nėra galimybės atspausdinti siuntos lipduko: siunta nerasta
lv: Nav iespējams izdrukāt DPD pavadlapu: Paka nav atrasta

source: The DPD shipment was cancelled for this order!
et: DPD saadetis on selle tellimuse jaoks tühistatud!
lt_lt: DPD siunta buvo atšaukta iš šio užsakymo!
lv: DPD sūtījums tika atcelts šim pasūtījumam!

source: Parcel has been picked up
et: Pakk on peale korjatud
lt_lt: Siunta paimta iš siuntėjo
lv: Paka tika paņemta no nosūtītāja

source: Parcel is at parcel delivery centre
et: Pakk on terminalis
lt_lt: Siunta yra paskirstymo centre
lv: Paka atrodas DPD noliktavā

source: Parcel is out for delivery
et: Pakk on toimetamisel
lt_lt: Siunta yra pristatoma
lv: Paka ir nodota piegādei

source: Additional information added
et: Täiendav info on lisatud
lt_lt: Pridėta papildoma informacija
lv: Pievienota papildus informācija

source: Parcel is successfully delivered
et: Pakk on edukalt kohale toimetatud
lt_lt: Siunta pristatyta gavėjui
lv: Paka ir veiksmīgi piegādāta

source: Delivery obstacle
et: Takistus kohaletoimetamisel
lt_lt: Nepavyko pristatyti
lv: Piegādes šķērslis

source: The parcel is not scanned by DPD yet
et: DPD pole veel pakki skänneerinud
lt_lt: Siunta neturi DPD skanų
lv: Paka vēl nav noskenēta

source: Track parcel
et: Jälgi paki teekonda
lt_lt: Sekti siuntą
lv: Izsekot sūtījumu

source: Shipping method is not DPD
et: Tarnemeetod pole DPD
lt_lt: Siuntimo būdas nėra DPD
lv: Nav izvēlēta DPD piegādes metode

source: DPD Tracking number: %s
et: DPD jälgimisnumber: %s
lt_lt: DPD siuntos numeris: %s
lv: DPD Pakas numurs: %s

source: Select warehouse
et: Vali ladu
lt_lt: Pasirinkti sandėlį
lv: Izvēlēties noliktavu

source: Comment for courier
et: Kommentaar kullerile
lt_lt: Komentaras kurjeriui
lv: Komentārs kurjeram

source: Pickup date
et: Pealekorje kuupäev
lt_lt: Paėmimo data
lv: Sūtījuma paņemšanas datums

source: Pickup time from
et: Pealekorje aeg alates
lt_lt: Paėmimo laikas nuo
lv: Paņemšanas laiks no

source: Pickup time until
et: Pealekorje aeg kuni
lt_lt: Paėmimo laikas iki
lv: Paņemšanas laiks līdz

source: Count of parcels
et: Pakkide arv
lt_lt: Pakuočių skaičius
lv: Paku skaits

source: Count of pallets
et: Aluste arv
lt_lt: Palečių skaičius
lv: Palešu skaits

source: Total weight
et: Kogukaal
lt_lt: Visas svoris
lv: Kopējais svars, kg

source: Request courier pickup
et: Telli kuller
lt_lt: Iškviesti DPD kurjerį
lv: Pieteikt kurjeru

source: Do you really want to close today's manifest?
et: Kas soovid tõesti tänase manifesti sulgeda?
lt_lt: Ar tikrai norite uždaryti šios dienos manifestą?
lv: Vai tiešām vēlaties aizvērt šodienas manifestu?

source: Close manifest
et: Sulge manifest
lt_lt: Uždaryti siuntų manifestą
lv: Aizvērt manifestu

source: Where should we pick up your parcels?
et: Kustkohast peaksime teie pakid peale korjama?
lt_lt: Iš kur paimti Jūsų siuntas?
lv: No kurienes jāpaņem paka?

source: Sender name
et: Saatja nimi
lt_lt: Siuntėjo pavadinimas
lv: Nosūtītāja nosaukums vai Vārds, Uzvārds

source: Sender address
et: Saatja aadress
lt_lt: Siuntėjo adresas
lv: Nosūtītāja adrese

source: Sender postcode
et: Saatja postikood
lt_lt: Siuntėjo pašto kodas
lv: Nosūtītāja pasta indekss

source: Sender city
et: Saatja linn
lt_lt: Siuntėjo miestas
lv: Nosūtītāja pilsēta

source: Sender country
et: Saatja riik
lt_lt: Siuntėjo šalis
lv: Nosūtītāja valsts

source: Select country
et: Vali riik
lt_lt: Pasirinkti šalį
lv: Izvēlēties valsti

source: Contact person phone number
et: Kontaktisiku telefoninumber
lt_lt: Kontaktinio asmens tel. nr
lv: Kontakpersonas telefona numurs

source: Contact person email address
et: Kontaktisiku e-maili aadress
lt_lt: Kontaktinio asmens el. paštas
lv: Kontaktpersonas e-pasts

source: Where should we deliver your parcels?
et: Kuhu peaksime teie pakid viima?
lt_lt: Kur pristatyti Jūsų siuntas?
lv: Uz kurieni jāpiegādā paka?

source: Recipient name
et: Saaja nimi
lt_lt: Gavėjo pavadinimas
lv: Saņēmēja nosaukums vai Vārds, Uzvārds

source: Recipient address
et: Saaja aadress
lt_lt: Gavėjo adresas
lv: Saņēmēja adrese

source: Recipient postcode
et: Saaja postikood
lt_lt: Gavėjo pašto kodas
lv: Saņēmēja pasta indekss

source: Recipient city
et: Saaja linn
lt_lt: Gavėjo miestas
lv: Saņēmēja pilsēta

source: Recipient country
et: Saaja riik
lt_lt: Gavėjo šalis
lv: Saņēmēja valsts

source: Details about your parcels/pallets
et: Andmed teie pakkide/aluste kohta
lt_lt: Informacija apie siuntas
lv: Informācija par Jūsu pakām/paletēm

source: Enter the amount of parcels/pallets
et: Sisestage pakkide/aluste arv
lt_lt: Įvesti informacija apie siuntas
lv: Ievadiet paku/palešu skaitu

source: Parcels
et: Pakk(i)
lt_lt: Pakuotės
lv: Pakas

source: Pallets
et: Alus(t)
lt_lt: Paletės
lv: Paletes

source: Total weight (kg)
et: Kogukaal (kg)
lt_lt: Viso svoris (kg)
lv: Kopējais svars (kg)

source: Additional information
et: Täiendav info
lt_lt: Papildoma informacija
lv: Papildus informācija

source: Provide your desired pickup date
et: Sisestage soovitud pealekorje kuupäev
lt_lt: Nurodykite pageidaujamą paėmimo datą
lv: Ievadiet vēlamo paņemšanas datumu

source: Request
et: Telli
lt_lt: Užsakyti
lv: Pieteikt

source: Manifests
et: Manifestid
lt_lt: Manifestai
lv: Manifesti

source: File name
et: Faili nimi
lt_lt: Failo pavadinimas
lv: Faila nosaukums

source: Date
et: Kuupäev
lt_lt: Data
lv: Datums

source: Download
et: Lae alla
lt_lt: Atsisiųsti
lv: Lejupielādēt

source: Name
et: Nimi
lt_lt: Pavadinimas
lv: Nosaukums vai Vārds, Uzvārds

source: Address
et: Aadress
lt_lt: Adresas
lv: Adrese

source: Postcode
et: Postikood
lt_lt: Pašto kodas
lv: Pasta indekss

source: City
et: Linn
lt_lt: Miestas
lv: Pilsēta

source: Contact person
et: Kontaktisik
lt_lt: Kontaktinis asmuo
lv: Kontaktpersona

source: Phone
et: Telefon
lt_lt: Telefonas
lv: Tālrunis

source: Delete
et: Kustuta
lt_lt: Ištrinti
lv: Dzēst

source: Add
et: Lisa
lt_lt: Pridėti
lv: Pievienot

source: General
et: Üldine
lt_lt: Bendri nustatymai
lv: Vispārēji iestatījumi

source: Parcels configurations
et: Pakkide seadistus
lt_lt: Siuntų nustatymai
lv: Sūtījumu iestatījumi

source: Warehouses
et: Laod
lt_lt: Sandėliai
lv: Noliktavas iestatījumi

source: Collection request
et: Korje kolmandalt osapoolelt
lt_lt: Siuntos paėmimas
lv: Paņemšanas pieprasījums

source: Default label format
et: Sildi formaat
lt_lt: Nustatytasis etiketės formatas
lv: Noklusējuma pavadlapas izdrukas izmērs

source: Parcel distribution
et: Pakkide jaotus
lt_lt: Siuntų paskirstymas
lv: Preču iepakošanas veids

source: All products in same parcel
et: Kõik tooted ühe pakina
lt_lt: Visos prekės toje pačioje pakuotėje
lv: Visas preces no pasūtījuma tiks iepakotas vienā pakā

source: Each product as separate parcel
et: Iga toode eraldi pakina
lt_lt: Skirtingos prekės atskirose pakuotėse
lv: Katra prece pasūtījumā tiks iepakota atsevišķā pakā

source: Each product quantity as separate parcel
et: Iga tootekogus eraldi pakina
lt_lt: Kiekviena prekė atskiroje pakuotėje
lv: Atsevišķās pakās tiks iepakots katras preces veida kopējais daudzums no pasūtījuma

source: Return labels
et: Tagastussiltide trükkimine
lt_lt: Grąžinimo etiketės
lv: Atgriešanas pavadlapas

source: Enable printing return labels
et: Luba tagastussiltide trükkimine
lt_lt: Leisti spausdinti Grąžinimo etiketes
lv: Aktivizēt atgriešanas pavadlapu drukāšanu

source: ROD / document return service
et: ROD / dokumenditagastus
lt_lt: Dokumentų grąžinimo paslauga
lv: ROD/Dokumentu atgriešanas pakalpojums

source: Enable ROD / document return service
et: Luba ROD / dokumenditagastusteenus
lt_lt: Aktyvuoti dokumentų grąžinimo paslaugą
lv: Aktivizēt ROD/Dokumentu atgriešanas pakalpojumu

source: DPD API options
et: DPD API seaded
lt_lt: DPD API nustatymai
lv: DPD API iestatījumi

source: DPD API country
et: DPD API teenusepakkuja
lt_lt: DPD API šalis
lv: DPD API pakalpojuma sniedzēja valsts

source: Select the DPD office that provided your API credentials.
et: Vali riik mille DPD kontorilt API andmed said
lt_lt: Pasirinkite DPD padalinį, su kuriuo turite sutartį ir iš kurio gavote API prisijungimus.
lv: Izvēlieties valsti, kas nodrošina Jūsu DPD API piekļuves datus.

source: API username
et: DPD API kasutajanimi
lt_lt: API vartotojo vardas
lv: API Lietotājvārds

source: API password
et: DPD API parool
lt_lt: API slaptažodis
lv: API Parole

source: Test mode
et: Test režiim
lt_lt: Testinė būsena
lv: Testa režīms

source: Enable DPD test mode
et: Luba DPD test režiim
lt_lt: Įjungti testinę būseną
lv: Aktivizēt DPD testa režīmu

source: Enable this if you want your requests to go to DPD's test server. Test server has separate credentials, ask from your local DPD office if required.
et: Luba see kui soovid, et päringut läheksid DPD test serverisse. Test serveril on eraldi kasutajanimi ja parool. Soovi korral küsi need oma kohalikust DPD-st.
lt_lt: Įjunkite šią būseną, jei norite siųsti užklausas į testinį DPD serverį. Testinis serveris turi atskirus prisijungimus, jeigu jų neturite, kreipkitės į support@dpd.lt.
lv: Aktivizējiet šo opciju, ja vēlaties, lai Jūsu pieprasījumi tiek nosūtīti uz DPD testa serveri. Testa serverim var būt savādāki piekļuves dati, ja tie ir nepieciešami, lūdzu, vērsieties pie DPD.

source: Fetch pickup points lists for these countries
et: Lae alla DPD Pickup punktid valitud riikide jaoks
lt_lt: Atsisiųsti pasirinktų šalių DPD paštomatų sąrašą
lv: Atrast Pickup punktus šīm valstīm

source: Google Maps API key
et: Google Mapsi API võti

source: Get your key
et: Saa võti
lt_lt: Gauti Google Maps API key
lv: Iegūt Google Maps API key

source: Google Maps will be used to suggest a postcode to your customer based on their address and to display a map of Pickup Points in checkout.
et: Google Mapsi kasutatakse klientidele postikoodi soovitamiseks ning pakiautomaatide kaardi näitamiseks kassas.
lt_lt: Google Maps API key reikalingas tam, kad surastume pašto kodą pagal pirkėjo adresą, taip pat parodyti Pickup siuntų taškus.
lv: Google Maps tiks izmantots, lai ieteiktu jūsu klientam pasta indeksu, ņemot vērā ievadīto adresi, un, lai parādītu Pickup punktu karti pasūtījuma noformēšanas laikā.

source: COD fee
et: COD lisatasu
lt_lt: COD mokestis
lv: COD piemaksa

source: This will add provided fee if cash on delivery is selected as the payment method in checkout.
et: See lisab hinnale määratud summa kui maksemeetodiks on COD.
lt_lt: Bus pridėtas nustatytas COD mokestis, jeigu pirkėjas pasirenka COD kaip mokėjimo metodą.
lv: Šī opcija pievienos papildus piemaksu, ja pie pasūtījuma noformēšanas tiks izvēlēta apmaksas opcija - naudas iekasēšana piegādes brīdī.

source: COD percentage fee
et: COD protsentuaalne lisatasu
lt_lt: COD procentinis mokestis
lv: COD procentuālā piemaksa

source: Courier will arrive from:
et: Kuller saabub alates:
lt_lt: Kurjeris atvyks nuo:
lv: Kurjers ieradīsies no:

source: until
et: kuni
lt_lt: iki
lv: līdz

source: DPD manifest is closed for today's orders that were made up to now. DPD doesn't require you to print the manifest. If you would like to print the manifest anyway, go <a href="%s">here</a>.
et: DPD manifest on tänaseks kuni praeguse hetkeni suletud. DPD kuller ei nõua trükitud kujul manifesti. Kui soovite siiski manifesti printida siis minge <a href="%s">siia</a>.
lt_lt: DPD manifestas uždarytas visoms siuntoms, kurios buvo sukurtos iki dabar. DPD nereikalauja pateikti spausdintą manifestą. Jeigu visgi norite turėti atspausdintą manifestą, spauskite <a href="%s">čia</a>.
lv: Manifests ir aizvērts pasūtījumiem, kuri ir sagatavoti līdz šim brīdim. DPD nepieprasa manifesta drukāšanu. Ja tomēr vēlaties to izdrukāt, dodaties uz <a href="%s">here</a>.

source: Your request was sent to DPD and your parcels will be collected. For more info call DPD.
et: Teie tellimus on edastatud ja DPD korjab teie saadetise peale. Lisainfo saamiseks helistage DPD-le.
lt_lt: Jūsų užsakymas paimti siuntas nusiųstas DPD.
lv: Jūsu pieprasījums tika nosūtīts uz DPD un paka tiks paņemta. Lai saņemtu papildus informāciju, lūdzu, sazinieties ar DPD.

source: Cash on delivery fee
et: COD lisatasu
lt_lt: COD mokestis
lv: Piemaksa par naudas iekasēšanu piegādes brīdī

source: Choose a Pickup Point
et: Vali Pickup-punkt
lt_lt: Pasirinkite DPD Pickup paštomatą
lv: Izvēlēties DPD Pickup punktu

source: Show Pickup Points
et: Näita pakiautomaate
lt_lt: Rodyti Pickup taškus
lv: Parādīt Pickup punktus

source: Search
et: Otsi
lt_lt: Ieškoti
lv: Meklēt

source: Working hours
et: Tööaeg
lt_lt: Darbo valandos
lv: Darba laiki

source: Monday:
et: Esmaspäev:
lt_lt: Pirmadienis:
lv: Pirmdiena:

source: Tuesday:
et: Teisipäev:
lt_lt: Antradienis:
lv: Otrdiena:

source: Wednesday:
et: Kolmapäev:
lt_lt: Trečiadienis:
lv: Trešdiena:

source: Thursday:
et: Neljapäev:
lt_lt: Ketvirtadienis:
lv: Ceturtdiena:

source: Friday:
et: Reede:
lt_lt: Penktadienis:
lv: Piektdiena:

source: Saturday:
et: Laupäev:
lt_lt: Šeštadienis:
lv: Sestdiena:

source: Sunday:
et: Pühapäev:
lt_lt: Sekmadienis:
lv: Svētdiena:

source: Contact
et: Kontakt
lt_lt: Kontaktai
lv: Kontakttālrunis

source: Select
et: Vali
lt_lt: Pasirinkti
lv: Izvēlēties

source: Timeframes
et: Ajavahemik
lt_lt: Laiko intervalai
lv: Laika intervāli

source: This will add provided fee + percentage fee from goods if cash on delivery will be selected as payment method.
lv: Šī opcija pievienos papildus piemaksu + procentuļau piemaksu no preces kopsummas, ja pie pasūtījuma noformēšanas tiks izvēlēta apmaksas opcija - naudas iekasēšana piegādes brīdī.
